#include"player.h"
#include"guanli.h"

void player::menu()
{
	printf("------------玩家界面----------\n");
	printf("------------------------------\n");
	printf("---------1.查看所有游戏-------\n");
	printf("--------2.选择游戏并开始------\n");
	printf("---------0.退出操作界面-------\n");
	printf("------------------------------\n");
	printf("------------------------------\n");
}

void player::choose()
{
	printf("--------------玩家界面------------\n");
	printf("----------------------------------\n");
	printf("-------请输入需要开始的游戏-------\n");
	printf("--------输入零退出操作界面--------\n");
	printf("----------------------------------\n");
}










